{
 "cells": [
  {
   "cell_type": "code",
   "id": "initial_id",
   "metadata": {
    "collapsed": true,
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:30.143802Z",
     "start_time": "2026-05-26T01:11:18.775795Z"
    }
   },
   "source": [
    "import pandas as pd\n",
    "import polars as pl\n",
    "import networkx as nx\n",
    "from maplib import Model, Prefix, Variable, Template, Parameter, RDFType, Triple, a"
   ],
   "outputs": [],
   "execution_count": 1
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:30.171841Z",
     "start_time": "2026-05-26T01:11:30.159970Z"
    }
   },
   "cell_type": "code",
   "source": [
    "BASE_STR = \"http://imt542.org/transit-lab/\"\n",
    "GTFS_STR = \"http://vocab.gtfs.org/terms#\"\n",
    "GEO_STR  = \"http://www.w3.org/2003/01/geo/wgs84_pos#\"\n",
    "XSD_STR  = \"http://www.w3.org/2001/XMLSchema#\""
   ],
   "id": "5a4d19e07d6cf60c",
   "outputs": [],
   "execution_count": 2
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:30.227184Z",
     "start_time": "2026-05-26T01:11:30.176242Z"
    }
   },
   "cell_type": "code",
   "source": [
    "base = Prefix(BASE_STR)\n",
    "gtfs = Prefix(GTFS_STR)\n",
    "geo = Prefix(GEO_STR)\n",
    "xsd = Prefix(XSD_STR)"
   ],
   "id": "bfa9aa47d7257209",
   "outputs": [],
   "execution_count": 3
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:31.332641Z",
     "start_time": "2026-05-26T01:11:30.304625Z"
    }
   },
   "cell_type": "code",
   "source": [
    "kcm_stops = pd.read_csv(\"data/kc_metro/stops.txt\", dtype={\"stop_id\": str})\n",
    "kcm_trips = pd.read_csv(\"data/kc_metro/trips.txt\", dtype={\"trip_id\": str, \"route_id\": str})\n",
    "kcm_routes = pd.read_csv(\"data/kc_metro/routes.txt\", dtype={\"route_id\": str})\n",
    "kcm_stop_times = pd.read_csv(\"data/kc_metro/stop_times.txt\", dtype={\"trip_id\": str, \"stop_id\": str, \"stop_headsign\": str})"
   ],
   "id": "b964d0f709ad39d",
   "outputs": [],
   "execution_count": 4
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:31.419497Z",
     "start_time": "2026-05-26T01:11:31.398092Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def make_uri(prefix,series):\n",
    "    return prefix + series"
   ],
   "id": "712cc310ca447128",
   "outputs": [],
   "execution_count": 5
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:31.459602Z",
     "start_time": "2026-05-26T01:11:31.423090Z"
    }
   },
   "cell_type": "code",
   "source": [
    "\n",
    "routes_pl = pl.from_pandas(pd.DataFrame({\n",
    "    \"route\": make_uri(BASE_STR + \"route/\", kcm_routes[\"route_id\"]),\n",
    "    \"route_short_name\": kcm_routes[\"route_short_name\"].values,\n",
    "    \"description\": kcm_routes[\"route_desc\"].values,\n",
    "}))\n",
    "routes_pl"
   ],
   "id": "c50e960c3bced74b",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "shape: (148, 3)\n",
       "┌─────────────────────────────────┬─────────────────────────┬─────────────────────────────────┐\n",
       "│ route                           ┆ route_short_name        ┆ description                     │\n",
       "│ ---                             ┆ ---                     ┆ ---                             │\n",
       "│ str                             ┆ str                     ┆ str                             │\n",
       "╞═════════════════════════════════╪═════════════════════════╪═════════════════════════════════╡\n",
       "│ http://imt542.org/transit-lab/… ┆ 1                       ┆ Kinnear - Downtown Seattle      │\n",
       "│ http://imt542.org/transit-lab/… ┆ 10                      ┆ Capitol Hill - Downtown Seattl… │\n",
       "│ http://imt542.org/transit-lab/… ┆ 101                     ┆ Renton Transit Center - Downto… │\n",
       "│ http://imt542.org/transit-lab/… ┆ 105                     ┆ Renton Highlands - Renton Tran… │\n",
       "│ http://imt542.org/transit-lab/… ┆ 106                     ┆ Renton Transit Center - Skyway… │\n",
       "│ …                               ┆ …                       ┆ …                               │\n",
       "│ http://imt542.org/transit-lab/… ┆ 249                     ┆ Spring District Station - Sout… │\n",
       "│ http://imt542.org/transit-lab/… ┆ 187                     ┆ Federal Way - Twin Lakes        │\n",
       "│ http://imt542.org/transit-lab/… ┆ 570                     ┆ Seattle - SeaTac Airport        │\n",
       "│ http://imt542.org/transit-lab/… ┆ Metro Match Day Shuttle ┆ Seattle Stadium - Seattle Cent… │\n",
       "│ http://imt542.org/transit-lab/… ┆ Waterfront Shuttle      ┆ Seattle Center - Downtown Seat… │\n",
       "└─────────────────────────────────┴─────────────────────────┴─────────────────────────────────┘"
      ],
      "text/html": [
       "<div><style>\n",
       ".dataframe > thead > tr,\n",
       ".dataframe > tbody > tr {\n",
       "  text-align: right;\n",
       "  white-space: pre-wrap;\n",
       "}\n",
       "</style>\n",
       "<small>shape: (148, 3)</small><table border=\"1\" class=\"dataframe\"><thead><tr><th>route</th><th>route_short_name</th><th>description</th></tr><tr><td>str</td><td>str</td><td>str</td></tr></thead><tbody><tr><td>&quot;http://imt542.org/transit-lab/…</td><td>&quot;1&quot;</td><td>&quot;Kinnear - Downtown Seattle&quot;</td></tr><tr><td>&quot;http://imt542.org/transit-lab/…</td><td>&quot;10&quot;</td><td>&quot;Capitol Hill - Downtown Seattl…</td></tr><tr><td>&quot;http://imt542.org/transit-lab/…</td><td>&quot;101&quot;</td><td>&quot;Renton Transit Center - Downto…</td></tr><tr><td>&quot;http://imt542.org/transit-lab/…</td><td>&quot;105&quot;</td><td>&quot;Renton Highlands - Renton Tran…</td></tr><tr><td>&quot;http://imt542.org/transit-lab/…</td><td>&quot;106&quot;</td><td>&quot;Renton Transit Center - Skyway…</td></tr><tr><td>&hellip;</td><td>&hellip;</td><td>&hellip;</td></tr><tr><td>&quot;http://imt542.org/transit-lab/…</td><td>&quot;249&quot;</td><td>&quot;Spring District Station - Sout…</td></tr><tr><td>&quot;http://imt542.org/transit-lab/…</td><td>&quot;187&quot;</td><td>&quot;Federal Way - Twin Lakes&quot;</td></tr><tr><td>&quot;http://imt542.org/transit-lab/…</td><td>&quot;570&quot;</td><td>&quot;Seattle - SeaTac Airport&quot;</td></tr><tr><td>&quot;http://imt542.org/transit-lab/…</td><td>&quot;Metro Match Day Shuttle&quot;</td><td>&quot;Seattle Stadium - Seattle Cent…</td></tr><tr><td>&quot;http://imt542.org/transit-lab/…</td><td>&quot;Waterfront Shuttle&quot;</td><td>&quot;Seattle Center - Downtown Seat…</td></tr></tbody></table></div>"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 6
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:31.602409Z",
     "start_time": "2026-05-26T01:11:31.485499Z"
    }
   },
   "cell_type": "code",
   "source": [
    "stops_pl = pl.from_pandas(pd.DataFrame({\n",
    "    \"stop\": make_uri(BASE_STR + \"stop/\", kcm_stops[\"stop_id\"]),\n",
    "    \"stop_name\": kcm_stops[\"stop_name\"].values,\n",
    "    \"stop_lat\": kcm_stops[\"stop_lat\"].astype(float).values,\n",
    "    \"stop_lon\": kcm_stops[\"stop_lon\"].astype(float).values,\n",
    "})).with_columns([\n",
    "    pl.col(\"stop_lat\").cast(pl.Decimal(precision=38, scale=12)),\n",
    "    pl.col(\"stop_lon\").cast(pl.Decimal(precision=38, scale=12)),\n",
    "])\n",
    "stops_pl"
   ],
   "id": "11a226111ef59a75",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "shape: (6_365, 4)\n",
       "┌──────────────────────────────┬─────────────────────────────┬─────────────────┬───────────────────┐\n",
       "│ stop                         ┆ stop_name                   ┆ stop_lat        ┆ stop_lon          │\n",
       "│ ---                          ┆ ---                         ┆ ---             ┆ ---               │\n",
       "│ str                          ┆ str                         ┆ decimal[38,12]  ┆ decimal[38,12]    │\n",
       "╞══════════════════════════════╪═════════════════════════════╪═════════════════╪═══════════════════╡\n",
       "│ http://imt542.org/transit-la ┆ 1st Ave & Spring St         ┆ 47.605136900000 ┆ -122.336533000000 │\n",
       "│ b/…                          ┆                             ┆                 ┆                   │\n",
       "│ http://imt542.org/transit-la ┆ 40th Ave NE & NE 51st St    ┆ 47.665885900000 ┆ -122.284897000000 │\n",
       "│ b/…                          ┆                             ┆                 ┆                   │\n",
       "│ http://imt542.org/transit-la ┆ NE 55th St & 39th Ave NE    ┆ 47.668579100000 ┆ -122.285667000000 │\n",
       "│ b/…                          ┆                             ┆                 ┆                   │\n",
       "│ http://imt542.org/transit-la ┆ NE 55th St & 37th Ave NE    ┆ 47.668579100000 ┆ -122.288300000000 │\n",
       "│ b/…                          ┆                             ┆                 ┆                   │\n",
       "│ http://imt542.org/transit-la ┆ NE 55th St & 35th Ave NE    ┆ 47.668579100000 ┆ -122.290512000000 │\n",
       "│ b/…                          ┆                             ┆                 ┆                   │\n",
       "│ …                            ┆ …                           ┆ …               ┆ …                 │\n",
       "│ http://imt542.org/transit-la ┆ Sand Point Way NE & 40th    ┆ 47.662742600000 ┆ -122.285202000000 │\n",
       "│ b/…                          ┆ Ave N…                      ┆                 ┆                   │\n",
       "│ http://imt542.org/transit-la ┆ NE 55th St & Princeton Ave  ┆ 47.669342000000 ┆ -122.276146000000 │\n",
       "│ b/…                          ┆ NE                          ┆                 ┆                   │\n",
       "│ http://imt542.org/transit-la ┆ NE 55th St & 45th Ave NE    ┆ 47.669025400000 ┆ -122.279846000000 │\n",
       "│ b/…                          ┆                             ┆                 ┆                   │\n",
       "│ http://imt542.org/transit-la ┆ Vashon Passenger Ferry &    ┆ 47.510940600000 ┆ -122.464722000000 │\n",
       "│ b/…                          ┆ Vasho…                      ┆                 ┆                   │\n",
       "│ http://imt542.org/transit-la ┆ Water Taxi Route & Harbor   ┆ 47.589374500000 ┆ -122.379440000000 │\n",
       "│ b/…                          ┆ Ave …                       ┆                 ┆                   │\n",
       "└──────────────────────────────┴─────────────────────────────┴─────────────────┴───────────────────┘"
      ],
      "text/html": [
       "<div><style>\n",
       ".dataframe > thead > tr,\n",
       ".dataframe > tbody > tr {\n",
       "  text-align: right;\n",
       "  white-space: pre-wrap;\n",
       "}\n",
       "</style>\n",
       "<small>shape: (6_365, 4)</small><table border=\"1\" class=\"dataframe\"><thead><tr><th>stop</th><th>stop_name</th><th>stop_lat</th><th>stop_lon</th></tr><tr><td>str</td><td>str</td><td>decimal[38,12]</td><td>decimal[38,12]</td></tr></thead><tbody><tr><td>&quot;http://imt542.org/transit-lab/…</td><td>&quot;1st Ave &amp; Spring St&quot;</td><td>47.605136900000</td><td>-122.336533000000</td></tr><tr><td>&quot;http://imt542.org/transit-lab/…</td><td>&quot;40th Ave NE &amp; NE 51st St&quot;</td><td>47.665885900000</td><td>-122.284897000000</td></tr><tr><td>&quot;http://imt542.org/transit-lab/…</td><td>&quot;NE 55th St &amp; 39th Ave NE&quot;</td><td>47.668579100000</td><td>-122.285667000000</td></tr><tr><td>&quot;http://imt542.org/transit-lab/…</td><td>&quot;NE 55th St &amp; 37th Ave NE&quot;</td><td>47.668579100000</td><td>-122.288300000000</td></tr><tr><td>&quot;http://imt542.org/transit-lab/…</td><td>&quot;NE 55th St &amp; 35th Ave NE&quot;</td><td>47.668579100000</td><td>-122.290512000000</td></tr><tr><td>&hellip;</td><td>&hellip;</td><td>&hellip;</td><td>&hellip;</td></tr><tr><td>&quot;http://imt542.org/transit-lab/…</td><td>&quot;Sand Point Way NE &amp; 40th Ave N…</td><td>47.662742600000</td><td>-122.285202000000</td></tr><tr><td>&quot;http://imt542.org/transit-lab/…</td><td>&quot;NE 55th St &amp; Princeton Ave NE&quot;</td><td>47.669342000000</td><td>-122.276146000000</td></tr><tr><td>&quot;http://imt542.org/transit-lab/…</td><td>&quot;NE 55th St &amp; 45th Ave NE&quot;</td><td>47.669025400000</td><td>-122.279846000000</td></tr><tr><td>&quot;http://imt542.org/transit-lab/…</td><td>&quot;Vashon Passenger Ferry &amp; Vasho…</td><td>47.510940600000</td><td>-122.464722000000</td></tr><tr><td>&quot;http://imt542.org/transit-lab/…</td><td>&quot;Water Taxi Route &amp; Harbor Ave …</td><td>47.589374500000</td><td>-122.379440000000</td></tr></tbody></table></div>"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 7
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:31.778290Z",
     "start_time": "2026-05-26T01:11:31.754999Z"
    }
   },
   "cell_type": "code",
   "source": [
    "trips_pl = pl.from_pandas(pd.DataFrame({\n",
    "    \"trip\": make_uri(BASE_STR + \"trip/\", kcm_trips[\"trip_id\"]),\n",
    "    \"route\": make_uri(BASE_STR + \"route/\", kcm_trips[\"route_id\"]),\n",
    "    \"trip_headsign\": kcm_trips[\"trip_headsign\"].values,\n",
    "}))\n",
    "\n",
    "# trips_pl.null_count()"
   ],
   "id": "7da435d71d231669",
   "outputs": [],
   "execution_count": 8
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:32.647646Z",
     "start_time": "2026-05-26T01:11:31.874756Z"
    }
   },
   "cell_type": "code",
   "source": [
    "st_pl = pl.from_pandas(pd.DataFrame({\n",
    "    \"stoptime\": make_uri(BASE_STR + \"stoptime/\", kcm_stop_times[\"stop_id\"]),\n",
    "    \"trip\": make_uri(BASE_STR + \"trip/\", kcm_stop_times[\"trip_id\"]),\n",
    "    \"stop\": make_uri(BASE_STR + \"stop/\", kcm_stop_times[\"stop_id\"]),\n",
    "    \"stop_sequence\": kcm_stop_times[\"stop_sequence\"].astype(str).values,\n",
    "    \"arrival_time\": kcm_stop_times[\"arrival_time\"].astype(str).values,\n",
    "    \"departure_time\": kcm_stop_times[\"departure_time\"].astype(str).values,\n",
    "}))\n",
    "# st_pl.null_count()"
   ],
   "id": "7d6f8260315b0800",
   "outputs": [],
   "execution_count": 9
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:32.717229Z",
     "start_time": "2026-05-26T01:11:32.711538Z"
    }
   },
   "cell_type": "code",
   "source": [
    "m = Model()\n",
    "r_var = Variable(\"route\")\n",
    "s_var = Variable(\"stop\")\n",
    "t_var = Variable(\"trip\")\n",
    "st_var = Variable(\"stoptime\")\n"
   ],
   "id": "b5947b58dda976a4",
   "outputs": [],
   "execution_count": 10
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:32.722987Z",
     "start_time": "2026-05-26T01:11:32.717805Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# OTTR templates\n",
    "# template has a signature and a pattern.\n",
    "# Signature contains the identifier and it's parameters\n",
    "# Pattern contains instances and can use parameters as arguments\n",
    "route_template = Template(\n",
    "    iri = base.suf(\"RouteTemplate\"),\n",
    "    parameters = [\n",
    "        Parameter(variable = r_var, rdf_type=RDFType.IRI),\n",
    "        Parameter(variable = Variable(\"route_short_name\"), rdf_type=RDFType.Literal(f\"{XSD_STR}string\")),\n",
    "        Parameter(variable = Variable(\"description\"), rdf_type=RDFType.Literal(f\"{XSD_STR}string\")),\n",
    "    ],\n",
    "    instances=[\n",
    "        Triple(r_var, a, gtfs.suf(\"route\")), # a refers to RDFType, imported from maplib this means ?route  rdf:type  gtfs:Route\n",
    "        Triple(r_var, gtfs.suf(\"route_short_name\"), Variable(\"route_short_name\")),\n",
    "        Triple(r_var, gtfs.suf(\"description\"), Variable(\"description\")),\n",
    "    ]\n",
    ")"
   ],
   "id": "8d6fc44af7f9aecc",
   "outputs": [],
   "execution_count": 11
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:32.729601Z",
     "start_time": "2026-05-26T01:11:32.723474Z"
    }
   },
   "cell_type": "code",
   "source": [
    "stop_template = Template(\n",
    "    iri=base.suf(\"StopTemplate\"),\n",
    "    parameters=[\n",
    "        Parameter(variable=s_var,                  rdf_type=RDFType.IRI),\n",
    "        Parameter(variable=Variable(\"stop_name\"),  rdf_type=RDFType.Literal(f\"{XSD_STR}string\")),\n",
    "        Parameter(variable=Variable(\"stop_lat\"),   rdf_type=RDFType.Literal(f\"{XSD_STR}decimal\")),\n",
    "        Parameter(variable=Variable(\"stop_lon\"),   rdf_type=RDFType.Literal(f\"{XSD_STR}decimal\")),\n",
    "    ],\n",
    "    instances=[\n",
    "        Triple(s_var, a,                  gtfs.suf(\"Stop\")),\n",
    "        Triple(s_var, gtfs.suf(\"name\"),   Variable(\"stop_name\")),\n",
    "        Triple(s_var, geo.suf(\"lat\"),     Variable(\"stop_lat\")),\n",
    "        Triple(s_var, geo.suf(\"long\"),    Variable(\"stop_lon\")),\n",
    "    ]\n",
    ")"
   ],
   "id": "ff22d10bdabd263e",
   "outputs": [],
   "execution_count": 12
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:32.768506Z",
     "start_time": "2026-05-26T01:11:32.730614Z"
    }
   },
   "cell_type": "code",
   "source": [
    "trip_template = Template(\n",
    "    iri = base.suf(\"TripTemplate\"),\n",
    "    parameters = [\n",
    "        Parameter(variable = t_var, rdf_type=RDFType.IRI),\n",
    "        Parameter(variable=r_var, rdf_type=RDFType.IRI),\n",
    "        Parameter(variable=Variable(\"trip_headsign\"), rdf_type=RDFType.Literal(f\"{XSD_STR}string\")),\n",
    "    ],\n",
    "    instances=[\n",
    "        Triple(t_var, a, gtfs.suf(\"trip\")),\n",
    "        Triple(t_var, gtfs.suf(\"route\"), r_var),\n",
    "        Triple(t_var, gtfs.suf(\"trip_headsign\"), Variable(\"trip_headsign\")),\n",
    "        Triple(r_var, gtfs.suf(\"trip\"), t_var) #backlink to route\n",
    "    ]\n",
    ")"
   ],
   "id": "6d7a99586aadc852",
   "outputs": [],
   "execution_count": 13
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:32.797137Z",
     "start_time": "2026-05-26T01:11:32.770330Z"
    }
   },
   "cell_type": "code",
   "source": [
    "stoptime_template = Template(\n",
    "    iri = base.suf(\"StopTimeTemplate\"),\n",
    "    parameters = [\n",
    "        Parameter(variable = st_var, rdf_type=RDFType.IRI),\n",
    "        Parameter(variable=t_var, rdf_type=RDFType.IRI),\n",
    "        Parameter(variable=s_var, rdf_type=RDFType.IRI),\n",
    "        Parameter(variable = Variable(\"stop_sequence\"), rdf_type=RDFType.Literal(f\"{XSD_STR}string\")),\n",
    "        Parameter(variable= Variable(\"arrival_time\"), rdf_type=RDFType.Literal(f\"{XSD_STR}string\")),\n",
    "        Parameter(variable=Variable(\"departure_time\"), rdf_type=RDFType.Literal(f\"{XSD_STR}string\")),\n",
    "    ],\n",
    "    instances=[\n",
    "        Triple(st_var, a, gtfs.suf(\"stop_time\")),\n",
    "        Triple(st_var, gtfs.suf(\"trip\"), t_var),\n",
    "        Triple(st_var, gtfs.suf(\"stop\"), s_var),\n",
    "        Triple(st_var, gtfs.suf(\"stop_sequence\"), Variable(\"stop_sequence\")),\n",
    "        Triple(st_var, gtfs.suf(\"arrival_time\"), Variable(\"arrival_time\")),\n",
    "        Triple(st_var, gtfs.suf(\"departure_time\"), Variable(\"departure_time\")),\n",
    "        Triple(t_var, gtfs.suf(\"stop_time\"), st_var),\n",
    "    ]\n",
    ")"
   ],
   "id": "bb0b15ac66bb3ab8",
   "outputs": [],
   "execution_count": 14
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:36.020593Z",
     "start_time": "2026-05-26T01:11:32.800266Z"
    }
   },
   "cell_type": "code",
   "source": [
    "m.map(route_template, routes_pl)\n",
    "m.map(stop_template, stops_pl)\n",
    "m.map(trip_template, trips_pl)\n",
    "m.map(stoptime_template, st_pl)\n"
   ],
   "id": "872bc7fcbf526fb2",
   "outputs": [],
   "execution_count": 15
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:36.078451Z",
     "start_time": "2026-05-26T01:11:36.045013Z"
    }
   },
   "cell_type": "code",
   "source": "print(m.query(\"SELECT ?s ?p ?o WHERE { ?s ?p ?o } LIMIT 10\"))",
   "id": "2f8b3efaed25a736",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "shape: (10, 3)\n",
      "┌─────────────────────────────────┬─────────────────────────────────┬──────────┐\n",
      "│ s                               ┆ p                               ┆ o        │\n",
      "│ ---                             ┆ ---                             ┆ ---      │\n",
      "│ str                             ┆ str                             ┆ str      │\n",
      "╞═════════════════════════════════╪═════════════════════════════════╪══════════╡\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://vocab.gtfs.org/terms#a… ┆ 04:30:00 │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://vocab.gtfs.org/terms#a… ┆ 05:00:00 │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://vocab.gtfs.org/terms#a… ┆ 05:15:00 │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://vocab.gtfs.org/terms#a… ┆ 05:30:00 │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://vocab.gtfs.org/terms#a… ┆ 05:45:00 │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://vocab.gtfs.org/terms#a… ┆ 06:00:00 │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://vocab.gtfs.org/terms#a… ┆ 06:06:00 │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://vocab.gtfs.org/terms#a… ┆ 06:12:00 │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://vocab.gtfs.org/terms#a… ┆ 06:15:00 │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://vocab.gtfs.org/terms#a… ┆ 06:18:00 │\n",
      "└─────────────────────────────────┴─────────────────────────────────┴──────────┘\n"
     ]
    }
   ],
   "execution_count": 16
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:36.098595Z",
     "start_time": "2026-05-26T01:11:36.079530Z"
    }
   },
   "cell_type": "code",
   "source": [
    "print(m.query(f\"\"\"\n",
    "    PREFIX gtfs: <{GTFS_STR}>\n",
    "    SELECT ?route WHERE {{ ?route a gtfs:route }} LIMIT 5\n",
    "\"\"\"))"
   ],
   "id": "2f130e9fc275f5de",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "shape: (5, 1)\n",
      "┌─────────────────────────────────┐\n",
      "│ route                           │\n",
      "│ ---                             │\n",
      "│ str                             │\n",
      "╞═════════════════════════════════╡\n",
      "│ <http://imt542.org/transit-lab… │\n",
      "│ <http://imt542.org/transit-lab… │\n",
      "│ <http://imt542.org/transit-lab… │\n",
      "│ <http://imt542.org/transit-lab… │\n",
      "│ <http://imt542.org/transit-lab… │\n",
      "└─────────────────────────────────┘\n"
     ]
    }
   ],
   "execution_count": 17
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:36.135630Z",
     "start_time": "2026-05-26T01:11:36.101217Z"
    }
   },
   "cell_type": "code",
   "source": [
    "print(m.query(f\"\"\"\n",
    "    PREFIX gtfs: <{GTFS_STR}>\n",
    "    SELECT ?route ?route_short_name WHERE {{ ?route gtfs:route_short_name ?route_short_name }} LIMIT 5\n",
    "\"\"\"))"
   ],
   "id": "df2e3a48ba612e03",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "shape: (5, 2)\n",
      "┌─────────────────────────────────┬──────────────────┐\n",
      "│ route                           ┆ route_short_name │\n",
      "│ ---                             ┆ ---              │\n",
      "│ str                             ┆ str              │\n",
      "╞═════════════════════════════════╪══════════════════╡\n",
      "│ <http://imt542.org/transit-lab… ┆ 1                │\n",
      "│ <http://imt542.org/transit-lab… ┆ 10               │\n",
      "│ <http://imt542.org/transit-lab… ┆ 101              │\n",
      "│ <http://imt542.org/transit-lab… ┆ 105              │\n",
      "│ <http://imt542.org/transit-lab… ┆ 106              │\n",
      "└─────────────────────────────────┴──────────────────┘\n"
     ]
    }
   ],
   "execution_count": 18
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:36.157419Z",
     "start_time": "2026-05-26T01:11:36.136542Z"
    }
   },
   "cell_type": "code",
   "source": [
    "print(m.query(f\"\"\"\n",
    "    PREFIX gtfs: <{GTFS_STR}>\n",
    "    SELECT ?trip WHERE {{ ?trip a gtfs:trip }} LIMIT 5\n",
    "\"\"\"))"
   ],
   "id": "23d0b9f03822551b",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "shape: (5, 1)\n",
      "┌─────────────────────────────────┐\n",
      "│ trip                            │\n",
      "│ ---                             │\n",
      "│ str                             │\n",
      "╞═════════════════════════════════╡\n",
      "│ <http://imt542.org/transit-lab… │\n",
      "│ <http://imt542.org/transit-lab… │\n",
      "│ <http://imt542.org/transit-lab… │\n",
      "│ <http://imt542.org/transit-lab… │\n",
      "│ <http://imt542.org/transit-lab… │\n",
      "└─────────────────────────────────┘\n"
     ]
    }
   ],
   "execution_count": 19
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:36.178123Z",
     "start_time": "2026-05-26T01:11:36.158192Z"
    }
   },
   "cell_type": "code",
   "source": [
    "print(m.query(f\"\"\"\n",
    "    PREFIX gtfs: <{GTFS_STR}>\n",
    "    SELECT ?route ?trip WHERE {{ ?route gtfs:trip ?trip }} LIMIT 5\n",
    "\"\"\"))"
   ],
   "id": "44e6b47199af0118",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "shape: (5, 2)\n",
      "┌─────────────────────────────────┬─────────────────────────────────┐\n",
      "│ route                           ┆ trip                            │\n",
      "│ ---                             ┆ ---                             │\n",
      "│ str                             ┆ str                             │\n",
      "╞═════════════════════════════════╪═════════════════════════════════╡\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://imt542.org/transit-lab… │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://imt542.org/transit-lab… │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://imt542.org/transit-lab… │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://imt542.org/transit-lab… │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://imt542.org/transit-lab… │\n",
      "└─────────────────────────────────┴─────────────────────────────────┘\n"
     ]
    }
   ],
   "execution_count": 20
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:36.199836Z",
     "start_time": "2026-05-26T01:11:36.178949Z"
    }
   },
   "cell_type": "code",
   "source": [
    "print(m.query(f\"\"\"\n",
    "    PREFIX gtfs: <{GTFS_STR}>\n",
    "    SELECT ?trip ?st WHERE {{ ?trip gtfs:stop_time ?st }} LIMIT 5\n",
    "\"\"\"))"
   ],
   "id": "30d3c4d188fa18cb",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "shape: (5, 2)\n",
      "┌─────────────────────────────────┬─────────────────────────────────┐\n",
      "│ trip                            ┆ st                              │\n",
      "│ ---                             ┆ ---                             │\n",
      "│ str                             ┆ str                             │\n",
      "╞═════════════════════════════════╪═════════════════════════════════╡\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://imt542.org/transit-lab… │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://imt542.org/transit-lab… │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://imt542.org/transit-lab… │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://imt542.org/transit-lab… │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://imt542.org/transit-lab… │\n",
      "└─────────────────────────────────┴─────────────────────────────────┘\n"
     ]
    }
   ],
   "execution_count": 21
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:36.220406Z",
     "start_time": "2026-05-26T01:11:36.201154Z"
    }
   },
   "cell_type": "code",
   "source": [
    "print(m.query(f\"\"\"\n",
    "    PREFIX gtfs: <{GTFS_STR}>\n",
    "    SELECT ?st ?stop ?stop_lat WHERE {{ ?st gtfs:stop ?stop }} LIMIT 5\n",
    "\"\"\"))"
   ],
   "id": "143679fc967f8b0c",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "shape: (5, 3)\n",
      "┌─────────────────────────────────┬─────────────────────────────────┬──────────┐\n",
      "│ st                              ┆ stop                            ┆ stop_lat │\n",
      "│ ---                             ┆ ---                             ┆ ---      │\n",
      "│ str                             ┆ str                             ┆ str      │\n",
      "╞═════════════════════════════════╪═════════════════════════════════╪══════════╡\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://imt542.org/transit-lab… ┆ null     │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://imt542.org/transit-lab… ┆ null     │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://imt542.org/transit-lab… ┆ null     │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://imt542.org/transit-lab… ┆ null     │\n",
      "│ <http://imt542.org/transit-lab… ┆ <http://imt542.org/transit-lab… ┆ null     │\n",
      "└─────────────────────────────────┴─────────────────────────────────┴──────────┘\n"
     ]
    }
   ],
   "execution_count": 22
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:36.267793Z",
     "start_time": "2026-05-26T01:11:36.221591Z"
    }
   },
   "cell_type": "code",
   "source": [
    "result = m.query(f\"\"\"\n",
    "    PREFIX gtfs: <{GTFS_STR}>\n",
    "    SELECT ?routeName (COUNT(DISTINCT ?stop) AS ?stopCount) WHERE {{\n",
    "        ?route gtfs:route_short_name ?routeName ;\n",
    "               gtfs:trip ?trip .\n",
    "        ?trip  gtfs:stop_time ?st .\n",
    "        ?st    gtfs:stop ?stop .\n",
    "    }}\n",
    "    GROUP BY ?routeName\n",
    "\"\"\")\n",
    "print(result)"
   ],
   "id": "b79ab97aefeaff8f",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "shape: (148, 2)\n",
      "┌───────────┬───────────┐\n",
      "│ routeName ┆ stopCount │\n",
      "│ ---       ┆ ---       │\n",
      "│ str       ┆ u32       │\n",
      "╞═══════════╪═══════════╡\n",
      "│ 12        ┆ 38        │\n",
      "│ 107       ┆ 137       │\n",
      "│ E Line    ┆ 74        │\n",
      "│ 160       ┆ 130       │\n",
      "│ 1         ┆ 56        │\n",
      "│ …         ┆ …         │\n",
      "│ 914       ┆ 76        │\n",
      "│ 67        ┆ 54        │\n",
      "│ 75        ┆ 89        │\n",
      "│ 895       ┆ 36        │\n",
      "│ 986       ┆ 15        │\n",
      "└───────────┴───────────┘\n"
     ]
    }
   ],
   "execution_count": 23
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:37.020008Z",
     "start_time": "2026-05-26T01:11:36.270002Z"
    }
   },
   "cell_type": "code",
   "source": "m.write(file_path=\"transit_ntriples.nt\", format=\"ntriples\")",
   "id": "d9fa7db82ede87c7",
   "outputs": [],
   "execution_count": 24
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:37.043141Z",
     "start_time": "2026-05-26T01:11:37.033958Z"
    }
   },
   "cell_type": "code",
   "source": [
    "G = nx.DiGraph()\n",
    "\n",
    "visual = {\n",
    "    \"route\":    {\"color\": \"#e74c3c\", \"size\": 30},\n",
    "    \"trip\":     {\"color\": \"#3498db\", \"size\": 15},\n",
    "    \"stop_time\": {\"color\": \"#f39c12\", \"size\": 5},\n",
    "    \"stop\":     {\"color\": \"#2ecc71\", \"size\": 10},\n",
    "}\n"
   ],
   "id": "c361a59c52185c41",
   "outputs": [],
   "execution_count": 25
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:37.443098Z",
     "start_time": "2026-05-26T01:11:37.044150Z"
    }
   },
   "cell_type": "code",
   "source": [
    "edges = m.query(f\"\"\"\n",
    "    PREFIX gtfs: <{GTFS_STR}>\n",
    "    SELECT ?s ?sType ?o ?oType ?p WHERE {{\n",
    "        {{\n",
    "            ?s a gtfs:route .    BIND(\"route\"    AS ?sType)\n",
    "            ?s gtfs:trip ?o .    BIND(\"trip\"     AS ?oType)\n",
    "            BIND(gtfs:trip AS ?p)\n",
    "        }}\n",
    "        UNION\n",
    "        {{\n",
    "            ?s a gtfs:trip .     BIND(\"trip\"     AS ?sType)\n",
    "            ?s gtfs:stop_time ?o . BIND(\"stop_time\" AS ?oType)\n",
    "            BIND(gtfs:stop_time AS ?p)\n",
    "        }}\n",
    "        UNION\n",
    "        {{\n",
    "            ?s a gtfs:stop_time . BIND(\"stop_time\" AS ?sType)\n",
    "            ?s gtfs:stop ?o .    BIND(\"stop\"     AS ?oType)\n",
    "            BIND(gtfs:stop AS ?p)\n",
    "        }}\n",
    "    }}\n",
    "\"\"\")"
   ],
   "id": "ea6519858ebc1947",
   "outputs": [],
   "execution_count": 26
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:40.304001Z",
     "start_time": "2026-05-26T01:11:37.444017Z"
    }
   },
   "cell_type": "code",
   "source": [
    "for row in edges.iter_rows(named=True):\n",
    "    s      = row[\"s\"]\n",
    "    o      = row[\"o\"]\n",
    "    p      = row[\"p\"].split(\"#\")[-1]\n",
    "    s_type = row[\"sType\"]\n",
    "    o_type = row[\"oType\"]\n",
    "\n",
    "    if s not in G:\n",
    "        G.add_node(s, label=s.split(\"/\")[-1],\n",
    "            nodeType=s_type,\n",
    "            color=visual[s_type][\"color\"],\n",
    "            size=float(visual[s_type][\"size\"]))\n",
    "    if o not in G:\n",
    "        G.add_node(o, label=o.split(\"/\")[-1],\n",
    "            nodeType=o_type,\n",
    "            color=visual[o_type][\"color\"],\n",
    "            size=float(visual[o_type][\"size\"]))\n",
    "    G.add_edge(s, o, label=p)\n",
    "\n",
    "print(f\"Graph — Nodes: {G.number_of_nodes()}, Edges: {G.number_of_edges()}\")\n"
   ],
   "id": "eb79d4bfe27e56cd",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Graph — Nodes: 46042, Edges: 1126888\n"
     ]
    }
   ],
   "execution_count": 27
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:48.826406Z",
     "start_time": "2026-05-26T01:11:40.382340Z"
    }
   },
   "cell_type": "code",
   "source": "nx.write_gexf(G, \"transit.gexf\")",
   "id": "88e0b21225d8ab2f",
   "outputs": [],
   "execution_count": 28
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "data wrangling and analysis, show more analysis\n",
    "or network analysis, narrow it down to a small area\n",
    "example what are transit hubs in an area"
   ],
   "id": "b4351943e21cb67"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:48.942910Z",
     "start_time": "2026-05-26T01:11:48.866202Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# 1. Check Stop nodes exist\n",
    "print(m.query(f\"\"\"\n",
    "    PREFIX gtfs: <http://vocab.gtfs.org/terms#>\n",
    "    SELECT ?stop WHERE {{\n",
    "        ?stop a gtfs:Stop .\n",
    "    }} LIMIT 5\n",
    "\"\"\"))"
   ],
   "id": "f89a1c008372f6c0",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "shape: (5, 1)\n",
      "┌─────────────────────────────────┐\n",
      "│ stop                            │\n",
      "│ ---                             │\n",
      "│ str                             │\n",
      "╞═════════════════════════════════╡\n",
      "│ <http://imt542.org/transit-lab… │\n",
      "│ <http://imt542.org/transit-lab… │\n",
      "│ <http://imt542.org/transit-lab… │\n",
      "│ <http://imt542.org/transit-lab… │\n",
      "│ <http://imt542.org/transit-lab… │\n",
      "└─────────────────────────────────┘\n"
     ]
    }
   ],
   "execution_count": 29
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:49.020686Z",
     "start_time": "2026-05-26T01:11:48.943926Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# 2. Check geo properties exist on stops\n",
    "print(m.query(f\"\"\"\n",
    "    PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "    SELECT ?stop ?stop_lat ?stop_lon WHERE {{\n",
    "        ?stop geo:lat  ?stop_lat ;\n",
    "              geo:long ?stop_lon .\n",
    "    }} LIMIT 5\n",
    "\"\"\"))"
   ],
   "id": "94489c52226889f7",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "shape: (5, 3)\n",
      "┌─────────────────────────────────┬─────────────────┬───────────────────┐\n",
      "│ stop                            ┆ stop_lat        ┆ stop_lon          │\n",
      "│ ---                             ┆ ---             ┆ ---               │\n",
      "│ str                             ┆ decimal[38,12]  ┆ decimal[38,12]    │\n",
      "╞═════════════════════════════════╪═════════════════╪═══════════════════╡\n",
      "│ <http://imt542.org/transit-lab… ┆ 47.605136900000 ┆ -122.336533000000 │\n",
      "│ <http://imt542.org/transit-lab… ┆ 47.665885900000 ┆ -122.284897000000 │\n",
      "│ <http://imt542.org/transit-lab… ┆ 47.668579100000 ┆ -122.285667000000 │\n",
      "│ <http://imt542.org/transit-lab… ┆ 47.668579100000 ┆ -122.288300000000 │\n",
      "│ <http://imt542.org/transit-lab… ┆ 47.668579100000 ┆ -122.290512000000 │\n",
      "└─────────────────────────────────┴─────────────────┴───────────────────┘\n"
     ]
    }
   ],
   "execution_count": 30
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:49.175883Z",
     "start_time": "2026-05-26T01:11:49.113022Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# 3. Check what properties Stop nodes actually have\n",
    "print(m.query(f\"\"\"\n",
    "    PREFIX gtfs: <http://vocab.gtfs.org/terms#>\n",
    "    SELECT ?p ?o WHERE {{\n",
    "        ?stop a gtfs:Stop .\n",
    "        ?stop ?p ?o .\n",
    "    }} LIMIT 20\n",
    "\"\"\"))"
   ],
   "id": "84c74c02c1671537",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "shape: (20, 2)\n",
      "┌─────────────────────────────────┬─────────────────────────────────┐\n",
      "│ p                               ┆ o                               │\n",
      "│ ---                             ┆ ---                             │\n",
      "│ str                             ┆ str                             │\n",
      "╞═════════════════════════════════╪═════════════════════════════════╡\n",
      "│ <http://www.w3.org/1999/02/22-… ┆ <http://vocab.gtfs.org/terms#S… │\n",
      "│ <http://www.w3.org/1999/02/22-… ┆ <http://vocab.gtfs.org/terms#S… │\n",
      "│ <http://www.w3.org/1999/02/22-… ┆ <http://vocab.gtfs.org/terms#S… │\n",
      "│ <http://www.w3.org/1999/02/22-… ┆ <http://vocab.gtfs.org/terms#S… │\n",
      "│ <http://www.w3.org/1999/02/22-… ┆ <http://vocab.gtfs.org/terms#S… │\n",
      "│ …                               ┆ …                               │\n",
      "│ <http://www.w3.org/1999/02/22-… ┆ <http://vocab.gtfs.org/terms#S… │\n",
      "│ <http://www.w3.org/1999/02/22-… ┆ <http://vocab.gtfs.org/terms#S… │\n",
      "│ <http://www.w3.org/1999/02/22-… ┆ <http://vocab.gtfs.org/terms#S… │\n",
      "│ <http://www.w3.org/1999/02/22-… ┆ <http://vocab.gtfs.org/terms#S… │\n",
      "│ <http://www.w3.org/1999/02/22-… ┆ <http://vocab.gtfs.org/terms#S… │\n",
      "└─────────────────────────────────┴─────────────────────────────────┘\n"
     ]
    }
   ],
   "execution_count": 31
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:49.234202Z",
     "start_time": "2026-05-26T01:11:49.193912Z"
    }
   },
   "cell_type": "code",
   "source": [
    "print(m.query(f\"\"\"\n",
    "    PREFIX gtfs: <{GTFS_STR}>\n",
    "    PREFIX geo:  <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "    SELECT ?s ?stop_name ?lat ?lon WHERE {{\n",
    "        ?s a gtfs:Stop ;\n",
    "           gtfs:name ?stop_name ;\n",
    "           geo:lat   ?lat ;\n",
    "           geo:long  ?lon .\n",
    "    }} LIMIT 5\n",
    "\"\"\"))"
   ],
   "id": "67e665f7c87384bf",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "shape: (5, 4)\n",
      "┌─────────────────────────────────┬──────────────────────────┬─────────────────┬───────────────────┐\n",
      "│ s                               ┆ stop_name                ┆ lat             ┆ lon               │\n",
      "│ ---                             ┆ ---                      ┆ ---             ┆ ---               │\n",
      "│ str                             ┆ str                      ┆ decimal[38,12]  ┆ decimal[38,12]    │\n",
      "╞═════════════════════════════════╪══════════════════════════╪═════════════════╪═══════════════════╡\n",
      "│ <http://imt542.org/transit-lab… ┆ 1st Ave & Spring St      ┆ 47.605136900000 ┆ -122.336533000000 │\n",
      "│ <http://imt542.org/transit-lab… ┆ 40th Ave NE & NE 51st St ┆ 47.665885900000 ┆ -122.284897000000 │\n",
      "│ <http://imt542.org/transit-lab… ┆ NE 55th St & 39th Ave NE ┆ 47.668579100000 ┆ -122.285667000000 │\n",
      "│ <http://imt542.org/transit-lab… ┆ NE 55th St & 37th Ave NE ┆ 47.668579100000 ┆ -122.288300000000 │\n",
      "│ <http://imt542.org/transit-lab… ┆ NE 55th St & 35th Ave NE ┆ 47.668579100000 ┆ -122.290512000000 │\n",
      "└─────────────────────────────────┴──────────────────────────┴─────────────────┴───────────────────┘\n"
     ]
    }
   ],
   "execution_count": 32
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:49.285682Z",
     "start_time": "2026-05-26T01:11:49.251697Z"
    }
   },
   "cell_type": "code",
   "source": [
    "print(m.query(f\"\"\"\n",
    "    PREFIX gtfs: <{GTFS_STR}>\n",
    "    PREFIX geo:  <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "    SELECT ?latBucket ?lonBucket (COUNT(DISTINCT ?stop) AS ?stopCount)\n",
    "    WHERE {{\n",
    "        {{\n",
    "            SELECT ?stop\n",
    "                   (ROUND(?stop_lat * 10) / 10 AS ?latBucket)\n",
    "                   (ROUND(?stop_lon * 10) / 10 AS ?lonBucket)\n",
    "            WHERE {{\n",
    "                ?stop a gtfs:Stop ;\n",
    "                      geo:lat  ?stop_lat ;\n",
    "                      geo:long ?stop_lon .\n",
    "            }}\n",
    "        }}\n",
    "    }}\n",
    "    GROUP BY ?latBucket ?lonBucket\n",
    "    ORDER BY DESC(?stopCount)\n",
    "\"\"\"))"
   ],
   "id": "85bdc034868d4650",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "shape: (42, 3)\n",
      "┌───────────┬───────────┬───────────┐\n",
      "│ latBucket ┆ lonBucket ┆ stopCount │\n",
      "│ ---       ┆ ---       ┆ ---       │\n",
      "│ f64       ┆ f64       ┆ u32       │\n",
      "╞═══════════╪═══════════╪═══════════╡\n",
      "│ 47.6      ┆ -122.3    ┆ 874       │\n",
      "│ 47.7      ┆ -122.3    ┆ 653       │\n",
      "│ 47.5      ┆ -122.3    ┆ 551       │\n",
      "│ 47.6      ┆ -122.4    ┆ 377       │\n",
      "│ 47.7      ┆ -122.2    ┆ 362       │\n",
      "│ …         ┆ …         ┆ …         │\n",
      "│ 47.4      ┆ -122.4    ┆ 4         │\n",
      "│ 47.9      ┆ -122.0    ┆ 3         │\n",
      "│ 47.5      ┆ -121.7    ┆ 2         │\n",
      "│ 47.6      ┆ -121.8    ┆ 2         │\n",
      "│ 47.3      ┆ -122.5    ┆ 1         │\n",
      "└───────────┴───────────┴───────────┘\n"
     ]
    }
   ],
   "execution_count": 33
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
