{
 "cells": [
  {
   "cell_type": "code",
   "id": "initial_id",
   "metadata": {
    "collapsed": true,
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:30.143802Z",
     "start_time": "2026-05-26T01:11:18.775795Z"
    }
   },
   "source": [
    "import pandas as pd\n",
    "import polars as pl\n",
    "import networkx as nx\n",
    "from maplib import Model, Prefix, Variable, Template, Parameter, RDFType, Triple, a"
   ],
   "outputs": [],
   "execution_count": 1
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "## Main data transformation:\n",
    "- Ingests gtfs transit files\n",
    "- Creates RDF Node templates for each object type\n",
    "- Constructs queryable graph model\n",
    "- serializes to N-triple file for export"
   ],
   "id": "4fce17a552d2cc0"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:30.171841Z",
     "start_time": "2026-05-26T01:11:30.159970Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Set up base identifiers for nodes (RDF standard)\n",
    "\n",
    "BASE_STR = \"http://imt542.org/transit-lab/\"\n",
    "GTFS_STR = \"http://vocab.gtfs.org/terms#\"\n",
    "GEO_STR  = \"http://www.w3.org/2003/01/geo/wgs84_pos#\"\n",
    "XSD_STR  = \"http://www.w3.org/2001/XMLSchema#\""
   ],
   "id": "5a4d19e07d6cf60c",
   "outputs": [],
   "execution_count": 2
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:30.227184Z",
     "start_time": "2026-05-26T01:11:30.176242Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Create maplib Prefix objects from base IRIs\n",
    "base = Prefix(BASE_STR)\n",
    "gtfs = Prefix(GTFS_STR)\n",
    "geo = Prefix(GEO_STR)\n",
    "xsd = Prefix(XSD_STR)"
   ],
   "id": "bfa9aa47d7257209",
   "outputs": [],
   "execution_count": 3
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:31.332641Z",
     "start_time": "2026-05-26T01:11:30.304625Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Load gtfs data from data source\n",
    "kcm_stops = pd.read_csv(\"data/kc_metro/stops.txt\", dtype={\"stop_id\": str})\n",
    "kcm_trips = pd.read_csv(\"data/kc_metro/trips.txt\", dtype={\"trip_id\": str, \"route_id\": str})\n",
    "kcm_routes = pd.read_csv(\"data/kc_metro/routes.txt\", dtype={\"route_id\": str})\n",
    "kcm_stop_times = pd.read_csv(\"data/kc_metro/stop_times.txt\", dtype={\"trip_id\": str, \"stop_id\": str, \"stop_headsign\": str})"
   ],
   "id": "b964d0f709ad39d",
   "outputs": [],
   "execution_count": 4
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:31.419497Z",
     "start_time": "2026-05-26T01:11:31.398092Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# function to build IRIs for node construction\n",
    "def make_uri(prefix,series):\n",
    "    return prefix + series"
   ],
   "id": "712cc310ca447128",
   "outputs": [],
   "execution_count": 5
  },
  {
   "metadata": {},
   "cell_type": "code",
   "source": [
    "# Create polars object from pandas dataframe and reformats to align with RDF objects. This is compatible with maplib/rust\n",
    "routes_pl = pl.from_pandas(pd.DataFrame({\n",
    "    \"route\": make_uri(BASE_STR + \"route/\", kcm_routes[\"route_id\"]),\n",
    "    \"route_short_name\": kcm_routes[\"route_short_name\"].values,\n",
    "    \"description\": kcm_routes[\"route_desc\"].values,\n",
    "}))"
   ],
   "id": "c50e960c3bced74b",
   "outputs": [],
   "execution_count": null
  },
  {
   "metadata": {},
   "cell_type": "code",
   "source": [
    "stops_pl = pl.from_pandas(pd.DataFrame({\n",
    "    \"stop\": make_uri(BASE_STR + \"stop/\", kcm_stops[\"stop_id\"]),\n",
    "    \"stop_name\": kcm_stops[\"stop_name\"].values,\n",
    "    \"stop_lat\": kcm_stops[\"stop_lat\"].astype(float).values,\n",
    "    \"stop_lon\": kcm_stops[\"stop_lon\"].astype(float).values,\n",
    "})).with_columns([\n",
    "    pl.col(\"stop_lat\").cast(pl.Decimal(precision=38, scale=12)),\n",
    "    pl.col(\"stop_lon\").cast(pl.Decimal(precision=38, scale=12)),\n",
    "])"
   ],
   "id": "11a226111ef59a75",
   "outputs": [],
   "execution_count": null
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:31.778290Z",
     "start_time": "2026-05-26T01:11:31.754999Z"
    }
   },
   "cell_type": "code",
   "source": [
    "trips_pl = pl.from_pandas(pd.DataFrame({\n",
    "    \"trip\": make_uri(BASE_STR + \"trip/\", kcm_trips[\"trip_id\"]),\n",
    "    \"route\": make_uri(BASE_STR + \"route/\", kcm_trips[\"route_id\"]),\n",
    "    \"trip_headsign\": kcm_trips[\"trip_headsign\"].values,\n",
    "}))\n"
   ],
   "id": "7da435d71d231669",
   "outputs": [],
   "execution_count": 8
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:32.647646Z",
     "start_time": "2026-05-26T01:11:31.874756Z"
    }
   },
   "cell_type": "code",
   "source": [
    "st_pl = pl.from_pandas(pd.DataFrame({\n",
    "    \"stoptime\": make_uri(BASE_STR + \"stoptime/\", kcm_stop_times[\"stop_id\"]),\n",
    "    \"trip\": make_uri(BASE_STR + \"trip/\", kcm_stop_times[\"trip_id\"]),\n",
    "    \"stop\": make_uri(BASE_STR + \"stop/\", kcm_stop_times[\"stop_id\"]),\n",
    "    \"stop_sequence\": kcm_stop_times[\"stop_sequence\"].astype(str).values,\n",
    "    \"arrival_time\": kcm_stop_times[\"arrival_time\"].astype(str).values,\n",
    "    \"departure_time\": kcm_stop_times[\"departure_time\"].astype(str).values,\n",
    "}))"
   ],
   "id": "7d6f8260315b0800",
   "outputs": [],
   "execution_count": 9
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:32.717229Z",
     "start_time": "2026-05-26T01:11:32.711538Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Initiates base model for building the graph in memory. Sets up variables for each node type\n",
    "m = Model()\n",
    "r_var = Variable(\"route\")\n",
    "s_var = Variable(\"stop\")\n",
    "t_var = Variable(\"trip\")\n",
    "st_var = Variable(\"stoptime\")\n"
   ],
   "id": "b5947b58dda976a4",
   "outputs": [],
   "execution_count": 10
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:32.722987Z",
     "start_time": "2026-05-26T01:11:32.717805Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# OTTR templates for each node type.\n",
    "\n",
    "# template has a signature and a pattern.\n",
    "# Signature contains the identifier and it's parameters\n",
    "# Pattern contains instances and can use parameters as arguments\n",
    "route_template = Template(\n",
    "    iri = base.suf(\"RouteTemplate\"),\n",
    "    parameters = [\n",
    "        Parameter(variable = r_var, rdf_type=RDFType.IRI),\n",
    "        Parameter(variable = Variable(\"route_short_name\"), rdf_type=RDFType.Literal(f\"{XSD_STR}string\")),\n",
    "        Parameter(variable = Variable(\"description\"), rdf_type=RDFType.Literal(f\"{XSD_STR}string\")),\n",
    "    ],\n",
    "    instances=[\n",
    "        Triple(r_var, a, gtfs.suf(\"route\")), # a refers to RDFType, imported from maplib this means ?route  rdf:type  gtfs:Route\n",
    "        Triple(r_var, gtfs.suf(\"route_short_name\"), Variable(\"route_short_name\")),\n",
    "        Triple(r_var, gtfs.suf(\"description\"), Variable(\"description\")),\n",
    "    ]\n",
    ")"
   ],
   "id": "8d6fc44af7f9aecc",
   "outputs": [],
   "execution_count": 11
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:32.729601Z",
     "start_time": "2026-05-26T01:11:32.723474Z"
    }
   },
   "cell_type": "code",
   "source": [
    "stop_template = Template(\n",
    "    iri=base.suf(\"StopTemplate\"),\n",
    "    parameters=[\n",
    "        Parameter(variable=s_var,                  rdf_type=RDFType.IRI),\n",
    "        Parameter(variable=Variable(\"stop_name\"),  rdf_type=RDFType.Literal(f\"{XSD_STR}string\")),\n",
    "        Parameter(variable=Variable(\"stop_lat\"),   rdf_type=RDFType.Literal(f\"{XSD_STR}decimal\")),\n",
    "        Parameter(variable=Variable(\"stop_lon\"),   rdf_type=RDFType.Literal(f\"{XSD_STR}decimal\")),\n",
    "    ],\n",
    "    instances=[\n",
    "        Triple(s_var, a,                  gtfs.suf(\"Stop\")),\n",
    "        Triple(s_var, gtfs.suf(\"name\"),   Variable(\"stop_name\")),\n",
    "        Triple(s_var, geo.suf(\"lat\"),     Variable(\"stop_lat\")),\n",
    "        Triple(s_var, geo.suf(\"long\"),    Variable(\"stop_lon\")),\n",
    "    ]\n",
    ")"
   ],
   "id": "ff22d10bdabd263e",
   "outputs": [],
   "execution_count": 12
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:32.768506Z",
     "start_time": "2026-05-26T01:11:32.730614Z"
    }
   },
   "cell_type": "code",
   "source": [
    "trip_template = Template(\n",
    "    iri = base.suf(\"TripTemplate\"),\n",
    "    parameters = [\n",
    "        Parameter(variable = t_var, rdf_type=RDFType.IRI),\n",
    "        Parameter(variable=r_var, rdf_type=RDFType.IRI),\n",
    "        Parameter(variable=Variable(\"trip_headsign\"), rdf_type=RDFType.Literal(f\"{XSD_STR}string\")),\n",
    "    ],\n",
    "    instances=[\n",
    "        Triple(t_var, a, gtfs.suf(\"trip\")),\n",
    "        Triple(t_var, gtfs.suf(\"route\"), r_var),\n",
    "        Triple(t_var, gtfs.suf(\"trip_headsign\"), Variable(\"trip_headsign\")),\n",
    "        Triple(r_var, gtfs.suf(\"trip\"), t_var) #backlink to route\n",
    "    ]\n",
    ")"
   ],
   "id": "6d7a99586aadc852",
   "outputs": [],
   "execution_count": 13
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:32.797137Z",
     "start_time": "2026-05-26T01:11:32.770330Z"
    }
   },
   "cell_type": "code",
   "source": [
    "stoptime_template = Template(\n",
    "    iri = base.suf(\"StopTimeTemplate\"),\n",
    "    parameters = [\n",
    "        Parameter(variable = st_var, rdf_type=RDFType.IRI),\n",
    "        Parameter(variable=t_var, rdf_type=RDFType.IRI),\n",
    "        Parameter(variable=s_var, rdf_type=RDFType.IRI),\n",
    "        Parameter(variable = Variable(\"stop_sequence\"), rdf_type=RDFType.Literal(f\"{XSD_STR}string\")),\n",
    "        Parameter(variable= Variable(\"arrival_time\"), rdf_type=RDFType.Literal(f\"{XSD_STR}string\")),\n",
    "        Parameter(variable=Variable(\"departure_time\"), rdf_type=RDFType.Literal(f\"{XSD_STR}string\")),\n",
    "    ],\n",
    "    instances=[\n",
    "        Triple(st_var, a, gtfs.suf(\"stop_time\")),\n",
    "        Triple(st_var, gtfs.suf(\"trip\"), t_var),\n",
    "        Triple(st_var, gtfs.suf(\"stop\"), s_var),\n",
    "        Triple(st_var, gtfs.suf(\"stop_sequence\"), Variable(\"stop_sequence\")),\n",
    "        Triple(st_var, gtfs.suf(\"arrival_time\"), Variable(\"arrival_time\")),\n",
    "        Triple(st_var, gtfs.suf(\"departure_time\"), Variable(\"departure_time\")),\n",
    "        Triple(t_var, gtfs.suf(\"stop_time\"), st_var),\n",
    "    ]\n",
    ")"
   ],
   "id": "bb0b15ac66bb3ab8",
   "outputs": [],
   "execution_count": 14
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:36.020593Z",
     "start_time": "2026-05-26T01:11:32.800266Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Graph built out mapping the polars data objects to the OTTR templates\n",
    "m.map(route_template, routes_pl)\n",
    "m.map(stop_template, stops_pl)\n",
    "m.map(trip_template, trips_pl)\n",
    "m.map(stoptime_template, st_pl)\n"
   ],
   "id": "872bc7fcbf526fb2",
   "outputs": [],
   "execution_count": 15
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:51:54.708110Z",
     "start_time": "2026-05-26T01:51:53.750640Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Serializes graph model to an N-Triple file (RDF compliant)\n",
    "m.write(file_path=\"output/transit_ntriples.nt\", format=\"ntriples\")"
   ],
   "id": "d9fa7db82ede87c7",
   "outputs": [],
   "execution_count": 34
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "_Process to create .gexf file for use with visualization software like Gephi (this can be skipped if you are only interested in the graph model)_",
   "id": "fe6128b7b99612d1"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:37.043141Z",
     "start_time": "2026-05-26T01:11:37.033958Z"
    }
   },
   "cell_type": "code",
   "source": [
    "\n",
    "\n",
    "G = nx.DiGraph()\n",
    "\n",
    "visual = {\n",
    "    \"route\":    {\"color\": \"#e74c3c\", \"size\": 30},\n",
    "    \"trip\":     {\"color\": \"#3498db\", \"size\": 15},\n",
    "    \"stop_time\": {\"color\": \"#f39c12\", \"size\": 5},\n",
    "    \"stop\":     {\"color\": \"#2ecc71\", \"size\": 10},\n",
    "}\n"
   ],
   "id": "c361a59c52185c41",
   "outputs": [],
   "execution_count": 25
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:37.443098Z",
     "start_time": "2026-05-26T01:11:37.044150Z"
    }
   },
   "cell_type": "code",
   "source": [
    "edges = m.query(f\"\"\"\n",
    "    PREFIX gtfs: <{GTFS_STR}>\n",
    "    SELECT ?s ?sType ?o ?oType ?p WHERE {{\n",
    "        {{\n",
    "            ?s a gtfs:route .    BIND(\"route\"    AS ?sType)\n",
    "            ?s gtfs:trip ?o .    BIND(\"trip\"     AS ?oType)\n",
    "            BIND(gtfs:trip AS ?p)\n",
    "        }}\n",
    "        UNION\n",
    "        {{\n",
    "            ?s a gtfs:trip .     BIND(\"trip\"     AS ?sType)\n",
    "            ?s gtfs:stop_time ?o . BIND(\"stop_time\" AS ?oType)\n",
    "            BIND(gtfs:stop_time AS ?p)\n",
    "        }}\n",
    "        UNION\n",
    "        {{\n",
    "            ?s a gtfs:stop_time . BIND(\"stop_time\" AS ?sType)\n",
    "            ?s gtfs:stop ?o .    BIND(\"stop\"     AS ?oType)\n",
    "            BIND(gtfs:stop AS ?p)\n",
    "        }}\n",
    "    }}\n",
    "\"\"\")"
   ],
   "id": "ea6519858ebc1947",
   "outputs": [],
   "execution_count": 26
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:40.304001Z",
     "start_time": "2026-05-26T01:11:37.444017Z"
    }
   },
   "cell_type": "code",
   "source": [
    "for row in edges.iter_rows(named=True):\n",
    "    s      = row[\"s\"]\n",
    "    o      = row[\"o\"]\n",
    "    p      = row[\"p\"].split(\"#\")[-1]\n",
    "    s_type = row[\"sType\"]\n",
    "    o_type = row[\"oType\"]\n",
    "\n",
    "    if s not in G:\n",
    "        G.add_node(s, label=s.split(\"/\")[-1],\n",
    "            nodeType=s_type,\n",
    "            color=visual[s_type][\"color\"],\n",
    "            size=float(visual[s_type][\"size\"]))\n",
    "    if o not in G:\n",
    "        G.add_node(o, label=o.split(\"/\")[-1],\n",
    "            nodeType=o_type,\n",
    "            color=visual[o_type][\"color\"],\n",
    "            size=float(visual[o_type][\"size\"]))\n",
    "    G.add_edge(s, o, label=p)\n",
    "\n",
    "print(f\"Graph — Nodes: {G.number_of_nodes()}, Edges: {G.number_of_edges()}\")\n"
   ],
   "id": "eb79d4bfe27e56cd",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Graph — Nodes: 46042, Edges: 1126888\n"
     ]
    }
   ],
   "execution_count": 27
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:52:11.780162Z",
     "start_time": "2026-05-26T01:52:03.436222Z"
    }
   },
   "cell_type": "code",
   "source": "nx.write_gexf(G, \"output/transit.gexf\")",
   "id": "88e0b21225d8ab2f",
   "outputs": [],
   "execution_count": 35
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "_Sample queries and outputs_",
   "id": "3baae8952371317d"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:49.234202Z",
     "start_time": "2026-05-26T01:11:49.193912Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Sample: get all information from a stop\n",
    "print(m.query(f\"\"\"\n",
    "    PREFIX gtfs: <{GTFS_STR}>\n",
    "    PREFIX geo:  <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "    SELECT ?s ?stop_name ?lat ?lon WHERE {{\n",
    "        ?s a gtfs:Stop ;\n",
    "           gtfs:name ?stop_name ;\n",
    "           geo:lat   ?lat ;\n",
    "           geo:long  ?lon .\n",
    "    }} LIMIT 5\n",
    "\"\"\"))"
   ],
   "id": "67e665f7c87384bf",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "shape: (5, 4)\n",
      "┌─────────────────────────────────┬──────────────────────────┬─────────────────┬───────────────────┐\n",
      "│ s                               ┆ stop_name                ┆ lat             ┆ lon               │\n",
      "│ ---                             ┆ ---                      ┆ ---             ┆ ---               │\n",
      "│ str                             ┆ str                      ┆ decimal[38,12]  ┆ decimal[38,12]    │\n",
      "╞═════════════════════════════════╪══════════════════════════╪═════════════════╪═══════════════════╡\n",
      "│ <http://imt542.org/transit-lab… ┆ 1st Ave & Spring St      ┆ 47.605136900000 ┆ -122.336533000000 │\n",
      "│ <http://imt542.org/transit-lab… ┆ 40th Ave NE & NE 51st St ┆ 47.665885900000 ┆ -122.284897000000 │\n",
      "│ <http://imt542.org/transit-lab… ┆ NE 55th St & 39th Ave NE ┆ 47.668579100000 ┆ -122.285667000000 │\n",
      "│ <http://imt542.org/transit-lab… ┆ NE 55th St & 37th Ave NE ┆ 47.668579100000 ┆ -122.288300000000 │\n",
      "│ <http://imt542.org/transit-lab… ┆ NE 55th St & 35th Ave NE ┆ 47.668579100000 ┆ -122.290512000000 │\n",
      "└─────────────────────────────────┴──────────────────────────┴─────────────────┴───────────────────┘\n"
     ]
    }
   ],
   "execution_count": 32
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-05-26T01:11:49.285682Z",
     "start_time": "2026-05-26T01:11:49.251697Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Sample: get count of stops by geographic bucket\n",
    "print(m.query(f\"\"\"\n",
    "    PREFIX gtfs: <{GTFS_STR}>\n",
    "    PREFIX geo:  <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "    SELECT ?latBucket ?lonBucket (COUNT(DISTINCT ?stop) AS ?stopCount)\n",
    "    WHERE {{\n",
    "        {{\n",
    "            SELECT ?stop\n",
    "                   (ROUND(?stop_lat * 10) / 10 AS ?latBucket)\n",
    "                   (ROUND(?stop_lon * 10) / 10 AS ?lonBucket)\n",
    "            WHERE {{\n",
    "                ?stop a gtfs:Stop ;\n",
    "                      geo:lat  ?stop_lat ;\n",
    "                      geo:long ?stop_lon .\n",
    "            }}\n",
    "        }}\n",
    "    }}\n",
    "    GROUP BY ?latBucket ?lonBucket\n",
    "    ORDER BY DESC(?stopCount)\n",
    "\"\"\"))"
   ],
   "id": "85bdc034868d4650",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "shape: (42, 3)\n",
      "┌───────────┬───────────┬───────────┐\n",
      "│ latBucket ┆ lonBucket ┆ stopCount │\n",
      "│ ---       ┆ ---       ┆ ---       │\n",
      "│ f64       ┆ f64       ┆ u32       │\n",
      "╞═══════════╪═══════════╪═══════════╡\n",
      "│ 47.6      ┆ -122.3    ┆ 874       │\n",
      "│ 47.7      ┆ -122.3    ┆ 653       │\n",
      "│ 47.5      ┆ -122.3    ┆ 551       │\n",
      "│ 47.6      ┆ -122.4    ┆ 377       │\n",
      "│ 47.7      ┆ -122.2    ┆ 362       │\n",
      "│ …         ┆ …         ┆ …         │\n",
      "│ 47.4      ┆ -122.4    ┆ 4         │\n",
      "│ 47.9      ┆ -122.0    ┆ 3         │\n",
      "│ 47.5      ┆ -121.7    ┆ 2         │\n",
      "│ 47.6      ┆ -121.8    ┆ 2         │\n",
      "│ 47.3      ┆ -122.5    ┆ 1         │\n",
      "└───────────┴───────────┴───────────┘\n"
     ]
    }
   ],
   "execution_count": 33
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
